'''============= Git =================='''
# Git - это распределённая сиситема контроля версий (система, записывающая
# изменения в файле или наборе файлов).
# Используется для отслеживания и ведения истории изменённия файлов, позволяет вернуть свою старую версия кода.
'''================ GitHub ================='''
# Онлайн сервис - который предоставляет услуги по хранению
# репозиториев и управлению  доступом.
# (аналоги GitHub, Bitbucket)

'''============ Команды ============'''
# git init -> Превращает директорию в git репозиторий (инициализирует
# дерикторию и проявляется скрытая дериктория .git) вводится только один раз

# git add .(всё содержимое директории)/ <filaname> (конкретный файл) -> остлеживание
# файлов или файла gitом

# git commit -m 'massage' -> Создание commitа с коментарием, сохранение в gite (локально но компе).

# git remote add <название_связи> (обычно origin) <ссылка_на_удалённый_репозиторий> (HTTPS/SSh) ->
# Cвязывает локальный репозиторий с удалённым.

# git push <название> main -> Отправка версии кода на удалённый репозиторий,
# в (GitHub репозиторий)

